erp3l/src/Catalogs/НастройкиФормированияПроводокМеждународногоУчета/НастройкиФормированияПроводокМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиФормированияПроводокМеждународногоУчета</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ПланыСчетовМеждународногоУчета</owners>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНераспределеннойПрибылиУбытка</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходыКР</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовКР</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыКР</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовКР</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходыОтРазницПриПересчетеВП</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовОтРазницПересчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыОтРазницПриПересчетеВП</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовОтРазницПересчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособАннулированияПроводок</name>
    <comment>Способ корректировки проводок на уменьшение: сторно или реверсивными проводками</comment>
    <type>
      <types>EnumRef.СпособыАннулированияПроводокМеждународногоУчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаДоходов</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетаРасходов</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетаПрибылейУбытков</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключитьИзПересчетаВП</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/AccountingRegisters/Международный/Международный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Международный</name>
  <chartOfAccounts>ChartOfAccounts.Международный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаПредставления</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроводки</name>
    <type>
      <types>CatalogRef.ШаблоныПроводокДляМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроводки</name>
    <type>
      <types>EnumRef.ТипыПроводокМеждународныйУчет</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеСчетаДт</name>
    <type>
      <types>CatalogRef.СоответствияСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеСчетаКт</name>
    <type>
      <types>CatalogRef.СоответствияСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеОборотов</name>
    <type>
      <types>CatalogRef.СоответствияОборотовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

erp3l/src/ChartsOfAccounts/Международный/Международный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Международный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоМеждународные</extDimensionTypes>
  <predefined>
    <items>
      <name>Служебный</name>
      <description>Служебный</description>
      <code>00000</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекласс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзРасчетаКурсовыхРазниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>УчетПоНаправлениямДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

erp3l/src/Catalogs/НастройкиФормированияПроводокМеждународногоУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает настройку формирования проводок, если она для плана счетов одна. Иначе возвращает Неопределено.
// 
// Параметры:
//   ПланСчетов - СправочникСсылка.ПланыСчетовМеждународногоУчета - 
//   
// Возвращаемое значение:
//   СправочникСсылка.НастройкиФормированияПроводокМеждународногоУчета, Неопределено - 
//
Функция НастройкаФормированияПроводокПоУмолчанию(ПланСчетов) Экспорт
	
	Если Не ЗначениеЗаполнено(ПланСчетов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	НастройкиФормированияПроводок.Ссылка
	|ИЗ
	|	Справочник.НастройкиФормированияПроводокМеждународногоУчета КАК НастройкиФормированияПроводок
	|ГДЕ
	|	НастройкиФормированияПроводок.Владелец = &ПланСчетов
	|	И НЕ НастройкиФормированияПроводок.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПланСчетов", ПланСчетов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Количество = Выборка.Количество();
	
	Если Количество = 0 Тогда
		
		ОсновнаяНастройка = Справочники.НастройкиФормированияПроводокМеждународногоУчета.СоздатьЭлемент();
		ОсновнаяНастройка.Наименование = НСтр("ru = 'Основная';
												|en = 'Main'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОсновнаяНастройка.Владелец = ПланСчетов;
		ОсновнаяНастройка.СпособАннулированияПроводок = Перечисления.СпособыАннулированияПроводокМеждународногоУчета.СторноПроводками;
		ОсновнаяНастройка.Записать();
		
		Возврат ОсновнаяНастройка.Ссылка;
		
	ИначеЕсли Количество = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // СчетаЗакрытия()

// Структура реквизитов элемента справочника содержащая счета закрытия периода.
//
// Возвращаемое значение:
//   Структура - в ключах структуры имена реквизитов (табличных частей) счетов закрытия.
//
Функция СчетаЗакрытия() Экспорт

	Результат = Новый Структура;
	
	ПустойСчет = ПланыСчетов.Международный.ПустаяСсылка();
	Результат.Вставить("СчетУчетаДоходов",	ПустойСчет);
	Результат.Вставить("СчетУчетаРасходов", ПустойСчет);
	Результат.Вставить("СчетУчетаНераспределеннойПрибылиУбытка", ПустойСчет);
	
	ПустаяТЗ = Новый ТаблицаЗначений;
	ПустаяТЗ.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Международный"));
	Результат.Вставить("СчетаДоходов",	ПустаяТЗ);
	Результат.Вставить("СчетаРасходов",	ПустаяТЗ);
	Результат.Вставить("СчетаПрибылейУбытков",ПустаяТЗ);
	
	Возврат Результат;

КонецФункции // СчетаЗакрытия()

// Структура реквизитов элемента справочника содержащие счета отражения курсовых разниц.
//
// Возвращаемое значение:
//   Структура - в ключах структуры имена реквизитов (табличных частей) счетов отражения курсовых разниц.
//
Функция СчетаКурсовыхРазниц() Экспорт

	Результат = Новый Структура;
	
	ПустойСчет = ПланыСчетов.Международный.ПустаяСсылка();
	Результат.Вставить("ДоходыКР", ПустойСчет);
	Результат.Вставить("СтатьяДоходовКР", Неопределено);
	
	Результат.Вставить("РасходыКР", ПустойСчет);
	Результат.Вставить("СтатьяРасходовКР", Неопределено);
	
	Результат.Вставить("ДоходыОтРазницПриПересчетеВП", ПустойСчет);
	Результат.Вставить("СтатьяДоходовОтРазницПересчета", Неопределено);
	
	Результат.Вставить("РасходыОтРазницПриПересчетеВП", ПустойСчет);
	Результат.Вставить("СтатьяРасходовОтРазницПересчета", Неопределено);
	
	ПустаяТЗ = Новый ТаблицаЗначений;
	ПустаяТЗ.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Международный"));
	Результат.Вставить("ИсключитьИзРасчетаКР",	ПустаяТЗ);
	Результат.Вставить("ИсключитьИзПересчетаВП",ПустаяТЗ);
	
	Возврат Результат;

КонецФункции // СчетаКурсовыхРазниц()

// Возвращает таблицу счетов исключения из расчета курсовых разниц.
// 
// Параметры:
//	ПланСчетов - СправочникСсылка.ПланыСчетовМеждународногоУчета - 
//	
// Возвращаемое значение:
//  ТаблицаЗначений - счета учета исключаемые из расчета курсовых разниц.
//
Функция СчетаИсключенияРасчетаКР(ПланСчетов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Международный.Ссылка КАК Счет,
	|	Международный.ИсключитьИзРасчетаКурсовыхРазниц КАК Исключить,
	|	Международный.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.Международный КАК Международный
	|ГДЕ
	|	Международный.ПланСчетов = &ПланСчетов
	|	И Международный.ИсключитьИзРасчетаКурсовыхРазниц = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Запрос.УстановитьПараметр("ПланСчетов", ПланСчетов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает таблицу счетов исключения из расчета курсовых разниц.
// 
// Параметры:
//	ПланСчетов - СправочникСсылка.ПланыСчетовМеждународногоУчета - 
//	СчетаИсключения - ТаблицаЗначений - Таблица с колонками:
//		* СчетУчета - ПланСчетовСсылка.Международный - 
//
Процедура ЗаписатьСчетаИсключенияРасчетаКР(ПланСчетов, СчетаИсключения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаИсключения.Счет КАК Ссылка
	|ПОМЕСТИТЬ СчетаИсключения
	|ИЗ
	|	&СчетаИсключения КАК СчетаИсключения
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	Международный.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|				И СчетаИсключения.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|				И НЕ СчетаИсключения.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|	КОНЕЦ КАК ИсключитьИзРасчетаКурсовыхРазниц
	|ИЗ
	|	ПланСчетов.Международный КАК Международный
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		СчетаИсключения КАК СчетаИсключения
	|	ПО
	|		Международный.Ссылка = СчетаИсключения.Ссылка
	|ГДЕ
	|	ВЫБОР
	|		КОГДА Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|				И СчетаИсключения.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|				И НЕ СчетаИсключения.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|	КОНЕЦ <> Международный.ИсключитьИзРасчетаКурсовыхРазниц
	|";
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	Выборка  = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект(); // ПланСчетовОбъект.Международный - 
		Объект.ИсключитьИзРасчетаКурсовыхРазниц = Выборка.ИсключитьИзРасчетаКурсовыхРазниц;
		Объект.Записать();
		
	КонецЦикла
	
КонецПроцедуры

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") 
		И Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("Владелец") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиФормированияПроводок.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ЕСТЬNULL(ПланыСчетовОрганизаций.Период, &ПустаяДата)) КАК ПериодПрименения
		|ПОМЕСТИТЬ ВтНастройкиФормированияПроводок
		|ИЗ
		|	Справочник.НастройкиФормированияПроводокМеждународногоУчета КАК НастройкиФормированияПроводок
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрСведений.ПланыСчетовМеждународногоУчетаОрганизаций КАК ПланыСчетовОрганизаций
		|	ПО
		|		ПланыСчетовОрганизаций.Организация = &Организация
		|		И ПланыСчетовОрганизаций.НастройкаФормированияПроводок = НастройкиФормированияПроводок.Ссылка
		|ГДЕ
		|	НЕ НастройкиФормированияПроводок.ПометкаУдаления
		|	И НастройкиФормированияПроводок.Владелец = &ПланСчетов
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|ВЫБРАТЬ
		|	НастройкиФормированияПроводок.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(НастройкиФормированияПроводок.Ссылка) КАК Представление,
		|	НастройкиФормированияПроводок.ПериодПрименения КАК ПериодПрименения
		|ИЗ
		|	ВтНастройкиФормированияПроводок КАК НастройкиФормированияПроводок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодПрименения УБЫВ
		|";
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("ПланСчетов", Параметры.Отбор.Владелец);
		Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
		Выборка = Запрос.Выполнить().Выбрать();
		Индекс = 0;
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.ПериодПрименения) Тогда
				Представление = Выборка.Представление;
			ИначеЕсли Индекс = 0 Тогда
				Представление = СтрШаблон(НСтр("ru = '%1 (применяется с %2)';
												|en = '%1 (applied since %2)'"), 
					Выборка.Представление, Формат(Выборка.ПериодПрименения, "ДЛФ=D"));
			Иначе
				Представление = СтрШаблон(НСтр("ru = '%1 (применялась с %2)';
												|en = '%1 (has been applied since %2)'"), 
					Выборка.Представление, Формат(Выборка.ПериодПрименения, "ДЛФ=D"));
			КонецЕсли;
			ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
			Индекс = Индекс + 1;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкаФормированияПроводокИспользуется(НастройкаФормированияПроводок) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НастройкаФормированияПроводок) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НастройкаФормированияПроводок", НастройкаФормированияПроводок);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПланыСчетовОрганизаций.ПланСчетов КАК ПланСчетов,
	|	ПланыСчетовОрганизаций.Организация КАК Организация,
	|	ПланыСчетовОрганизаций.Период КАК НачалоПериода,
	|	ЕСТЬNULL(МИНИМУМ(ПериодыОкончанияДействияНастроек.Период), &ТекущаяДата) КАК ОкончаниеПериода
	|ИЗ
	|	РегистрСведений.ПланыСчетовМеждународногоУчетаОрганизаций КАК ПланыСчетовОрганизаций
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланыСчетовМеждународногоУчетаОрганизаций КАК ПериодыОкончанияДействияНастроек
	|		ПО ПланыСчетовОрганизаций.ПланСчетов = ПериодыОкончанияДействияНастроек.ПланСчетов
	|		 И ПланыСчетовОрганизаций.Организация = ПериодыОкончанияДействияНастроек.Организация
	|		 И ПланыСчетовОрганизаций.Период < ПериодыОкончанияДействияНастроек.Период
	|ГДЕ
	|	ПланыСчетовОрганизаций.НастройкаФормированияПроводок = &НастройкаФормированияПроводок
	|СГРУППИРОВАТЬ ПО
	|	ПланыСчетовОрганизаций.ПланСчетов,
	|	ПланыСчетовОрганизаций.Организация,
	|	ПланыСчетовОрганизаций.Период
	|";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	ТекстЗапросаПроводок = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	РегистрБухгалтерии.Международный КАК Международный
	|ГДЕ
	|	Международный.Период МЕЖДУ &НачалоПериода77 И &ОкончаниеПериода77
	|	И Международный.ПланСчетов = &ПланСчетов77
	|	И Международный.Организация = &Организация77
	|";
	
	Выборка = Результат.Выбрать();
	ТекстыЗапросов = Новый Массив();
	НомерЗапроса = 1;
	
	Пока Выборка.Следующий() Цикл
		ТекстыЗапросов.Добавить(СтрЗаменить(ТекстЗапросаПроводок, "77", НомерЗапроса));
		Запрос.УстановитьПараметр("НачалоПериода" + НомерЗапроса, Выборка.НачалоПериода);
		Запрос.УстановитьПараметр("ОкончаниеПериода" + НомерЗапроса, Выборка.ОкончаниеПериода);
		Запрос.УстановитьПараметр("ПланСчетов" + НомерЗапроса, Выборка.ПланСчетов);
		Запрос.УстановитьПараметр("Организация" + НомерЗапроса, Выборка.Организация);
		НомерЗапроса = НомерЗапроса + 1;
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.НастройкиФормированияПроводокМеждународногоУчета.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.7.131";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b97c2e17-da01-4920-ad6d-71b357965eb3");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.НастройкиФормированияПроводокМеждународногоУчета.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизиты ""План счетов"" и ""Способ аннулирования проводок"".';
									|en = 'Fills in the ""Chart of accounts"" and ""Entry cancellation method"" attributes.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.НастройкиФормированияПроводокМеждународногоУчета.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.ПланыСчетовМеждународногоУчета.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.НастройкиФормированияПроводокМеждународногоУчета.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.НастройкиФормированияПроводокМеждународногоУчета.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "МультиязычностьСервер.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Справочник.Ссылка
	|ИЗ
	|	Справочник.НастройкиФормированияПроводокМеждународногоУчета КАК Справочник
	|ГДЕ
	|	Справочник.Владелец = ЗНАЧЕНИЕ(Справочник.ПланыСчетовМеждународногоУчета.ПустаяСсылка)
	|	ИЛИ Справочник.СпособАннулированияПроводок = ЗНАЧЕНИЕ(Перечисление.СпособыАннулированияПроводокМеждународногоУчета.ПустаяСсылка)
	|";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	ПланСчетовПоУмолчанию = Справочники.ПланыСчетовМеждународногоУчета.ПланСчетовПоУмолчанию();
	
	Для Каждого Справочник Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			Ссылка = Справочник.Ссылка;
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = Ссылка.ПолучитьОбъект();// - СправочникОбъект.НастройкиФормированияПроводокМеждународногоУчета - 
			
			Если СправочникОбъект <> Неопределено Тогда
				Если Не ЗначениеЗаполнено(СправочникОбъект.Владелец) Тогда
					СправочникОбъект.Владелец = ПланСчетовПоУмолчанию;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СправочникОбъект.СпособАннулированияПроводок) Тогда
					СправочникОбъект.СпособАннулированияПроводок = Перечисления.СпособыАннулированияПроводокМеждународногоУчета.СторноПроводками;
				КонецЕсли;
			КонецЕсли;
			
			Если СправочникОбъект <> Неопределено И СправочникОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Ссылка);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Справочник.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
